review_app/app/controllers/application_controller.rb

    def current_user
    @current_user ||=User.find(session[ :username]) if session[ :username]
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1