review_app/app/controllers/products_controller.rb

    def create
        @product=Product.new(product_params)
        if @product.save
---
INSERT INTO `products` (`user_id`, `brand`, `avgcost`, `category`, `releasedate`, `description`, `productphoto_file_name`, `productphoto_content_type`, `productphoto_file_size`, `productphoto_updated_at`, `created_at`, `updated_at`) VALUES (1, 'Apple iPhone 6', 400.0, 'Smartphones', '2020-02-05', 'The new Apple iPhone 6 released with new functionality for recording better quality pictures.', 'iphone6.jpg', 'image/jpeg', 66732, '2020-04-19 05:38:02', '2020-04-19 05:38:03.076752', '2020-04-19 05:38:03.076752')

    def show
        @product=Product.find(params[:id])
        @users=User.find(params[:id])
        @reviews=Review.where(product_id: params[:id])
---
SELECT `products`.* FROM `products` WHERE `products`.`id` = 1 LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT `reviews`.* FROM `reviews` WHERE `reviews`.`product_id` IS NULL LIMIT 1

    def search
        @products = if params[:term]
            Product.where(["brand = ?", "#{params[:term]}"])
        else
            Product.all
---
SELECT `products`.* FROM `products` WHERE (brand = 'Apple')
SELECT `products`.* FROM `products`