review_app/app/controllers/products_controller.rb

SELECT `reviews`.* FROM `reviews` WHERE `reviews`.`id` IN (2, NULL)
---
    def show
        @product=Product.find(params[:id])
        @review=Review.find(params[:id])