review_app/app/controllers/profiles_controller.rb

    def index
        @profiles=Profile.all
---
SELECT `profiles`.* FROM `profiles`

    def create
        @profile=Profile.new(profile_params)
        if @profile.save
---
INSERT INTO `profiles` (`user_id`, `fullname`, `dob`, `address`, `citytown`, `country`, `created_at`, `updated_at`) VALUES (1, 'bob peterson', '2001-08-06', '65 Millhouses lane', 'Derry', 'Ireland', '2020-04-19 06:07:07.973287', '2020-04-19 06:07:07.973287')

    def edit
        @profile=Profile.find(params[:id])
---
SELECT `profiles`.* FROM `profiles` WHERE `profiles`.`id` = 1 LIMIT 1

    def update
        @profile=Profile.find(params[:id])
        if @profile.update(profile_params)
---
SELECT `profiles`.* FROM `profiles` WHERE `profiles`.`id` = 1 LIMIT 1
UPDATE `profiles` SET `profiles`.`fullname` = 'Bob Peterson', `profiles`.`dob` = '1979-08-06', `profiles`.`citytown` = 'Sheffield', `profiles`.`country` = 'UK', `profiles`.`updated_at` = '2020-04-19 07:13:26.756695' WHERE `profiles`.`id` = 1

    def show
        @profile=Profile.find(params[:id])
        @user=User.find(params[:id])
---
SELECT `profiles`.* FROM `profiles` WHERE `profiles`.`id` = 1 LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1