review_app/app/controllers/profiles_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
    def show
        @profile=Profile.find(params[:id])
        @user=User.find(params[:id])