review_app/app/controllers/reviews_controller.rb

SELECT `reviews`.* FROM `reviews`
---
    def index
        @products=Product.all
        @reviews=Review.all

INSERT INTO `reviews` (`user_id`, `product_id`, `author`, `rating`, `reviewcontent`, `date`, `created_at`, `updated_at`) VALUES (4, 3, 'Linda Smith', 5, 'Yeah the Air is ok.', '2020-04-09', '2020-04-20 08:28:26.093308', '2020-04-20 08:28:26.093308')
---
    def create
        @review=Review.new(review_params)
        if @review.save

SELECT `reviews`.* FROM `reviews` WHERE `reviews`.`id` = 1 LIMIT 1
---
    def show
        @review=Review.find(params[:id])

SELECT `reviews`.* FROM `reviews` WHERE `reviews`.`id` = 4 LIMIT 1
---
    def edit
        @review=Review.find(params[:id])

SELECT `reviews`.* FROM `reviews` WHERE `reviews`.`id` = 4 LIMIT 1
UPDATE `reviews` SET `reviews`.`rating` = 4, `reviews`.`reviewcontent` = 'The iPad is not as good as the iPhone.', `reviews`.`updated_at` = '2020-04-19 12:43:49.845576' WHERE `reviews`.`id` = 4
---
    def update
        @review=Review.find(params[:id])
        if @review.update(review_params)

SELECT `reviews`.* FROM `reviews` WHERE `reviews`.`id` = 3 LIMIT 1
DELETE FROM `reviews` WHERE `reviews`.`id` = 3
---
    def destroy
        @review=Review.find(params[:id])
        @review.destroy