review_app/app/controllers/users_controller.rb

INSERT INTO `users` (`username`, `email`, `password_digest`, `userphoto_file_name`, `userphoto_content_type`, `userphoto_file_size`, `userphoto_updated_at`, `created_at`, `updated_at`) VALUES ('bobadmin2', 'billiejean2@jackson.com', '$2a$12$kAGMSE68i.xA312ooyCgXeJ6R5ez7c4KA1vy6fZARVsA/kpQhhfeS', 'profile2.jpg', 'image/jpeg', 276312, '2020-04-18 12:19:17', '2020-04-18 12:19:17.189529', '2020-04-18 12:19:17.189529')
---
    def create
        @user=User.new(user_params)
        if @user.save