review_app/app/controllers/users_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = NULL LIMIT 1
UPDATE `users` SET `users`.`username` = 'bobadmins2', `users`.`password_digest` = '$2a$12$nQ9EzagDhZ1fc84ejhvWqe5C8cLAbUvN2CYEwYFpQvVpumTvOaEWK', `users`.`userphoto_file_name` = 'profile3.jpg', `users`.`userphoto_file_size` = 218728, `users`.`userphoto_updated_at` = '2020-04-19 07:07:53', `users`.`updated_at` = '2020-04-19 07:07:53.239492' WHERE `users`.`id` = 1
---
    def update
        @user=User.find(params[:id])
        if @user.update(user_params)

INSERT INTO `users` (`username`, `email`, `password_digest`, `userphoto_file_name`, `userphoto_content_type`, `userphoto_file_size`, `userphoto_updated_at`, `created_at`, `updated_at`) VALUES ('sharonuser', 'sharon@gmail.com', '$2a$12$luYNTlg20.v0BcUGYQaAVe6y3f5sGGgfuTDWt6.Erve4xD/NaEcsy', 'profile4.jpg', 'image/jpeg', 70670, '2020-04-19 07:27:41', '2020-04-19 07:27:41.112552', '2020-04-19 07:27:41.112552')
---
    def create
        @user=User.new(user_params)
        if @user.save