review_app/app/views/profiles/new.html.erb

        <div class="card">
        <%= f.select :user_id, User.all.collect {|x| [x.username, x.id]}, {:include_blank => 'Select User'}, class: 'form-control'%><br><br>
---
SELECT `users`.* FROM `users`