review_app/app/views/reviews/edit.html.erb

SELECT `products`.* FROM `products`
---
        <%= f.label :Update_Product %>
        <%= f.select :product_id, Product.all.collect {|x| [x.brand, x.id]}, {:include_blank => 'Select Product'}, class: 'form-control'%><br><br>

SELECT `users`.* FROM `users`
---
        <%= f.label :Update_User %>
        <%= f.select :user_id, User.all.collect {|x| [x.username, x.id]}, {:include_blank => 'Select User'}, class: 'form-control'%><br><br>