review_app/app/views/reviews/new.html.erb

        <div class="card">
        <%= f.select :product_id, Product.all.collect {|x| [x.brand, x.id]}, {:include_blank => 'Select Product'}, class: 'form-control'%><br><br>
        <%= f.select :user_id, User.all.collect {|x| [x.username, x.id]}, {:include_blank => 'Select User'}, class: 'form-control'%><br><br>
---
SELECT `products`.* FROM `products`
SELECT `users`.* FROM `users`